esp8266/Arduino/build/linux/work/hardware/tools/avr/lib/avr/include/avr/iom32m1.h
#define AC1CON _SFR_MEM8(0x95)
#define AC1M0 0
#define AC1M1 1
#define AC1M2 2
#define AC1ICE 3
#define AC1IS0 4
#define AC1IS1 5
#define AC1IE 6
#define AC1EN 7

#define AC2CON _SFR_MEM8(0x96)
#define AC2M0 0
#define AC2M1 1
#define AC2M2 2
#define AC2IS0 4
#define AC2IS1 5
#define AC2IE 6
#define AC2EN 7

#define AC3CON _SFR_MEM8(0x97)
#define AC3M0 0
#define AC3M1 1
#define AC3M2 2
#define AC3IS0 4
#define AC3IS1 5
#define AC3IE 6
#define AC3EN 7

#define POCR0SA _SFR_MEM16(0xA0)

#define POCR0SAL _SFR_MEM8(0xA0)
#define POCR0SA_0 0
#define POCR0SA_1 1
#define POCR0SA_2 2
#define POCR0SA_3 3
#define POCR0SA_4 4
#define POCR0SA_5 5
#define POCR0SA_6 6
#define POCR0SA_7 7

#define POCR0SAH _SFR_MEM8(0xA1)
#define POCR0SA_8 0
#define POCR0SA_9 1
#define POCR0SA_00 2
#define POCR0SA_01 3

#define POCR0RA _SFR_MEM16(0xA2)

#define POCR0RAL _SFR_MEM8(0xA2)
#define POCR0RA_0 0
#define POCR0RA_1 1
#define POCR0RA_2 2
#define POCR0RA_3 3
#define POCR0RA_4 4
#define POCR0RA_5 5
#define POCR0RA_6 6
#define POCR0RA_7 7

#define POCR0RAH _SFR_MEM8(0xA3)
#define POCR0RA_8 0
#define POCR0RA_9 1
#define POCR0RA_00 2
#define POCR0RA_01 3

#define POCR0SB _SFR_MEM16(0xA4)

#define POCR0SBL _SFR_MEM8(0xA4)
#define POCR0SB_0 0
#define POCR0SB_1 1
#define POCR0SB_2 2
#define POCR0SB_3 3
#define POCR0SB_4 4
#define POCR0SB_5 5
#define POCR0SB_6 6
#define POCR0SB_7 7

#define POCR0SBH _SFR_MEM8(0xA5)
#define POCR0SB_8 0
#define POCR0SB_9 1
#define POCR0SB_00 2
#define POCR0SB_01 3

#define POCR1SA _SFR_MEM16(0xA6)

#define POCR1SAL _SFR_MEM8(0xA6)
#define POCR1SA_0 0
#define POCR1SA_1 1
#define POCR1SA_2 2
#define POCR1SA_3 3
#define POCR1SA_4 4
#define POCR1SA_5 5
#define POCR1SA_6 6
#define POCR1SA_7 7

#define POCR1SAH _SFR_MEM8(0xA7)
#define POCR1SA_8 0
#define POCR1SA_9 1
#define POCR1SA_00 2
#define POCR1SA_01 3

#define POCR1RA _SFR_MEM16(0xA8)

#define POCR1RAL _SFR_MEM8(0xA8)
#define POCR1RA_0 0
#define POCR1RA_1 1
#define POCR1RA_2 2
#define POCR1RA_3 3
#define POCR1RA_4 4
#define POCR1RA_5 5
#define POCR1RA_6 6
#define POCR1RA_7 7

#define POCR1RAH _SFR_MEM8(0xA9)
#define POCR1RA_8 0
#define POCR1RA_9 1
#define POCR1RA_00 2
#define POCR1RA_01 4

#define POCR1SB _SFR_MEM16(0xAA)

#define POCR1SBL _SFR_MEM8(0xAA)
#define POCR1SB_0 0
#define POCR1SB_1 1
#define POCR1SB_2 2
#define POCR1SB_3 3
#define POCR1SB_4 4
#define POCR1SB_5 5
#define POCR1SB_6 6
#define POCR1SB_7 7

#define POCR1SBH _SFR_MEM8(0xAB)
#define POCR1SB_8 0
#define POCR1SB_9 1
#define POCR1SB_00 2
#define POCR1SB_01 3

#define POCR2SA _SFR_MEM16(0xAC)

#define POCR2SAL _SFR_MEM8(0xAC)
#define POCR2SA_0 0
#define POCR2SA_1 1
#define POCR2SA_2 2
#define POCR2SA_3 3
#define POCR2SA_4 4
#define POCR2SA_5 5
#define POCR2SA_6 6
#define POCR2SA_7 7

#define POCR2SAH _SFR_MEM8(0xAD)
#define POCR2SA_8 0
#define POCR2SA_9 1
#define POCR2SA_00 2
#define POCR2SA_01 3

#define POCR2RA _SFR_MEM16(0xAE)

#define POCR2RAL _SFR_MEM8(0xAE)
#define POCR2RA_0 0
#define POCR2RA_1 1
#define POCR2RA_2 2
#define POCR2RA_3 3
#define POCR2RA_4 4
#define POCR2RA_5 5
#define POCR2RA_6 6
#define POCR2RA_7 7

#define POCR2RAH _SFR_MEM8(0xAF)
#define POCR2RA_8 0
#define POCR2RA_9 1
#define POCR2RA_00 2
#define POCR2RA_01 3

#define POCR2SB _SFR_MEM16(0xB0)

#define POCR2SBL _SFR_MEM8(0xB0)
#define POCR2SB_0 0
#define POCR2SB_1 1
#define POCR2SB_2 2
#define POCR2SB_3 3
#define POCR2SB_4 4
#define POCR2SB_5 5
#define POCR2SB_6 6
#define POCR2SB_7 7

#define POCR2SBH _SFR_MEM8(0xB1)
#define POCR2SB_8 0
#define POCR2SB_9 1
#define POCR2SB_00 2
#define POCR2SB_01 3

#define POCRxRB _SFR_MEM16(0xB2)

#define POCRxRBL _SFR_MEM8(0xB2)
#define POCR_RB_0 0
#define POCR_RB_1 1
#define POCR_RB_2 2
#define POCR_RB_3 3
#define POCR_RB_4 4
#define POCR_RB_5 5
#define POCR_RB_6 6
#define POCR_RB_7 7

#define POCRxRBH _SFR_MEM8(0xB3)
#define POCR_RB_8 0
#define POCR_RB_9 1
#define POCR_RB_00 2
#define POCR_RB_01 3

#define PSYNC _SFR_MEM8(0xB4)
#define PSYNC00 0
#define PSYNC01 1
#define PSYNC10 2
#define PSYNC11 3
#define PSYNC20 4
#define PSYNC21 5

#define PCNF _SFR_MEM8(0xB5)
#define POPA 2
#define POPB 3
#define PMODE 4
#define PULOCK 5

#define POC _SFR_MEM8(0xB6)
#define POEN0A 0
#define POEN0B 1
#define POEN1A 2
#define POEN1B 3
#define POEN2A 4
#define POEN2B 5

#define PCTL _SFR_MEM8(0xB7)
#define PRUN 0
#define PCCYC 1
#define PCLKSEL 5
#define PPRE0 6
#define PPRE1 7

#define PMIC0 _SFR_MEM8(0xB8)
#define PRFM00 0
#define PRFM01 1
#define PRFM02 2
#define PAOC0 3
#define PFLTE0 4
#define PELEV0 5
#define PISEL0 6
#define POVEN0 7

#define PMIC1 _SFR_MEM8(0xB9)
#define PRFM10 0
#define PRFM11 1
#define PRFM12 2
#define PAOC1 3
#define PFLTE1 4
#define PELEV1 5
#define PISEL1 6
#define POVEN1 7

#define PMIC2 _SFR_MEM8(0xBA)
#define PRFM20 0
#define PRFM21 1
#define PRFM22 2
#define PAOC2 3
#define PFLTE2 4
#define PELEV2 5
#define PISEL2 6
#define POVEN2 7

#define PIM _SFR_MEM8(0xBB)
#define PEOPE 0
#define PEVE0 1
#define PEVE1 2
#define PEVE2 3

#define PIFR _SFR_MEM8(0xBC)
#define PEOP 0
#define PEV0 1
#define PEV1 2
#define PEV2 3

#define LINCR _SFR_MEM8(0xC8)
#define LCMD0 0
#define LCMD1 1
#define LCMD2 2
#define LENA 3
#define LCONF0 4
#define LCONF1 5
#define LIN13 6
#define LSWRES 7

#define LINSIR _SFR_MEM8(0xC9)
#define LRXOK 0
#define LTXOK 1
#define LIDOK 2
#define LERR 3
#define LBUSY 4
#define LIDST0 5
#define LIDST1 6
#define LIDST2 7

#define LINENIR _SFR_MEM8(0xCA)
#define LENRXOK 0
#define LENTXOK 1
#define LENIDOK 2
#define LENERR 3

#define LINERR _SFR_MEM8(0xCB)
#define LBERR 0
#define LCERR 1
#define LPERR 2
#define LSERR 3
#define LFERR 4
#define LOVERR 5
#define LTOERR 6
#define LABORT 7

#define LINBTR _SFR_MEM8(0xCC)
#define LBT0 0
#define LBT1 1
#define LBT2 2
#define LBT3 3
#define LBT4 4
#define LBT5 5
#define LDISR 7

#define LINBRR _SFR_MEM16(0xCD)

#define LINBRRL _SFR_MEM8(0xCD)
#define LDIV0 0
#define LDIV1 1
#define LDIV2 2
#define LDIV3 3
#define LDIV4 4
#define LDIV5 5
#define LDIV6 6
#define LDIV7 7

#define LINBRRH _SFR_MEM8(0xCE)
#define LDIV8 0
#define LDIV9 1
#define LDIV10 2
#define LDIV11 3

