esp8266/Arduino/build/linux/work/hardware/tools/avr/lib/avr/include/avr/iom32m1.h
#define LINDLR _SFR_MEM8(0xCF)
#define LRXDL0 0
#define LRXDL1 1
#define LRXDL2 2
#define LRXDL3 3
#define LTXDL0 4
#define LTXDL1 5
#define LTXDL2 6
#define LTXDL3 7

#define LINIDR _SFR_MEM8(0xD0)
#define LID0 0
#define LID1 1
#define LID2 2
#define LID3 3
#define LID4 4
#define LID5 5
#define LP0 6
#define LP1 7

#define LINSEL _SFR_MEM8(0xD1)
#define LINDX0 0
#define LINDX1 1
#define LINDX2 2
#define LAINC 3

#define LINDAT _SFR_MEM8(0xD2)
#define LDATA0 0
#define LDATA1 1
#define LDATA2 2
#define LDATA3 3
#define LDATA4 4
#define LDATA5 5
#define LDATA6 6
#define LDATA7 7

#define CANGCON _SFR_MEM8(0xD8)
#define SWRES 0
#define ENASTB 1
#define TEST 2
#define LISTEN 3
#define SYNTTC 4
#define TTC 5
#define OVRQ 6
#define ABRQ 7

#define CANGSTA _SFR_MEM8(0xD9)
#define ERRP 0
#define BOFF 1
#define ENFG 2
#define RXBSY 3
#define TXBSY 4
#define OVFG 6

#define CANGIT _SFR_MEM8(0xDA)
#define AERG 0
#define FERG 1
#define CERG 2
#define SERG 3
#define BXOK 4
#define OVRTIM 5
#define BOFFIT 6
#define CANIT 7

#define CANGIE _SFR_MEM8(0xDB)
#define ENOVRT 0
#define ENERG 1
#define ENBX 2
#define ENERR 3
#define ENTX 4
#define ENRX 5
#define ENBOFF 6
#define ENIT 7

#define CANEN2 _SFR_MEM8(0xDC)
#define ENMOB0 0
#define ENMOB1 1
#define ENMOB2 2
#define ENMOB3 3
#define ENMOB4 4
#define ENMOB5 5

#define CANEN1 _SFR_MEM8(0xDD)

#define CANIE2 _SFR_MEM8(0xDE)
#define IEMOB0 0
#define IEMOB1 1
#define IEMOB2 2
#define IEMOB3 3
#define IEMOB4 4
#define IEMOB5 5

#define CANIE1 _SFR_MEM8(0xDF)

#define CANSIT2 _SFR_MEM8(0xE0)
#define SIT0 0
#define SIT1 1
#define SIT2 2
#define SIT3 3
#define SIT4 4
#define SIT5 5

#define CANSIT1 _SFR_MEM8(0xE1)

#define CANBT1 _SFR_MEM8(0xE2)
#define BRP0 1
#define BRP1 2
#define BRP2 3
#define BRP3 4
#define BRP4 5
#define BRP5 6

#define CANBT2 _SFR_MEM8(0xE3)
#define PRS0 1
#define PRS1 2
#define PRS2 3
#define SJW0 5
#define SJW1 6

#define CANBT3 _SFR_MEM8(0xE4)
#define SMP 0
#define PHS10 1
#define PHS11 2
#define PHS12 3
#define PHS20 4
#define PHS21 5
#define PHS22 6

#define CANTCON _SFR_MEM8(0xE5)

#define CANTIML _SFR_MEM8(0xE6)

#define CANTIMH _SFR_MEM8(0xE7)

#define CANTTCL _SFR_MEM8(0xE8)

#define CANTTCH _SFR_MEM8(0xE9)

#define CANTEC _SFR_MEM8(0xEA)

#define CANREC _SFR_MEM8(0xEB)

#define CANHPMOB _SFR_MEM8(0xEC)
#define CGP0 0
#define CGP1 1
#define CGP2 2
#define CGP3 3
#define HPMOB0 4
#define HPMOB1 5
#define HPMOB2 6
#define HPMOB3 7

#define CANPAGE _SFR_MEM8(0xED)
#define INDX0 0
#define INDX1 1
#define INDX2 2
#define AINC 3
#define MOBNB0 4
#define MOBNB1 5
#define MOBNB2 6
#define MOBNB3 7

#define CANSTMOB _SFR_MEM8(0xEE)
#define AERR 0
#define FERR 1
#define CERR 2
#define SERR 3
#define BERR 4
#define RXOK 5
#define TXOK 6
#define DLCW 7

#define CANCDMOB _SFR_MEM8(0xEF)
#define DLC0 0
#define DLC1 1
#define DLC2 2
#define DLC3 3
#define IDE 4 
#define RPLV 5
#define CONMOB0 6
#define CONMOB1 7

#define CANIDT4 _SFR_MEM8(0xF0)
#define RB0TAG 0
#define RB1TAG 1
#define RTRTAG 2
#define IDT0 3
#define IDT1 4
#define IDT2 5
#define IDT3 6
#define IDT4 7

#define CANIDT3 _SFR_MEM8(0xF1)
#define IDT5 0
#define IDT6 1
#define IDT7 2
#define IDT8 3
#define IDT9 4
#define IDT10 5
#define IDT11 6
#define IDT12 7

#define CANIDT2 _SFR_MEM8(0xF2)
#define IDT13 0
#define IDT14 1
#define IDT15 2
#define IDT16 3
#define IDT17 4
#define IDT18 5
#define IDT19 6
#define IDT20 7

#define CANIDT1 _SFR_MEM8(0xF3)
#define IDT21 0
#define IDT22 1
#define IDT23 2
#define IDT24 3
#define IDT25 4
#define IDT26 5
#define IDT27 6
#define IDT28 7

#define CANIDM4 _SFR_MEM8(0xF4)
#define IDEMSK 0
#define RTRMSK 2
#define IDMSK0 3
#define IDMSK1 4
#define IDMSK2 5
#define IDMSK3 6
#define IDMSK4 7

#define CANIDM3 _SFR_MEM8(0xF5)
#define IDMSK5 0
#define IDMSK6 1
#define IDMSK7 2
#define IDMSK8 3
#define IDMSK9 4
#define IDMSK10 5
#define IDMSK11 6
#define IDMSK12 7

#define CANIDM2 _SFR_MEM8(0xF6)
#define IDMSK13 0
#define IDMSK14 1
#define IDMSK15 2
#define IDMSK16 3
#define IDMSK17 4
#define IDMSK18 5
#define IDMSK19 6
#define IDMSK20 7

#define CANIDM1 _SFR_MEM8(0xF7)
#define IDMSK21 0
#define IDMSK22 1
#define IDMSK23 2
#define IDMSK24 3
#define IDMSK25 4
#define IDMSK26 5
#define IDMSK27 6
#define IDMSK28 7

#define CANSTML _SFR_MEM8(0xF8)

#define CANSTMH _SFR_MEM8(0xF9)

#define CANMSG _SFR_MEM8(0xFA)



/* Interrupt Vectors */
/* Interrupt Vector 0 is the reset vector. */
#define ANACOMP0_vect       _VECTOR(1)  /* Analog Comparator 0 */
#define ANACOMP1_vect       _VECTOR(2)  /* Analog Comparator 1 */
#define ANACOMP2_vect       _VECTOR(3)  /* Analog Comparator 2 */
#define ANACOMP3_vect       _VECTOR(4)  /* Analog Comparator 3 */
#define PSC_FAULT_vect      _VECTOR(5)  /* PSC Fault */
#define PSC_EC_vect         _VECTOR(6)  /* PSC End of Cycle */
#define INT0_vect           _VECTOR(7)  /* External Interrupt Request 0 */
#define INT1_vect           _VECTOR(8)  /* External Interrupt Request 1 */
#define INT2_vect           _VECTOR(9)  /* External Interrupt Request 2 */
#define INT3_vect           _VECTOR(10)  /* External Interrupt Request 3 */
#define TIMER1_CAPT_vect    _VECTOR(11)  /* Timer/Counter1 Capture Event */
#define TIMER1_COMPA_vect   _VECTOR(12)  /* Timer/Counter1 Compare Match A */
#define TIMER1_COMPB_vect   _VECTOR(13)  /* Timer/Counter1 Compare Match B */
#define TIMER1_OVF_vect     _VECTOR(14)  /* Timer1/Counter1 Overflow */
#define TIMER0_COMPA_vect   _VECTOR(15)  /* Timer/Counter0 Compare Match A */
#define TIMER0_COMPB_vect   _VECTOR(16)  /* Timer/Counter0 Compare Match B */
#define TIMER0_OVF_vect     _VECTOR(17)  /* Timer/Counter0 Overflow */
#define CAN_INT_vect        _VECTOR(18)  /* CAN MOB, Burst, General Errors */
#define CAN_TOVF_vect       _VECTOR(19)  /* CAN Timer Overflow */
#define LIN_TC_vect         _VECTOR(20)  /* LIN Transfer Complete */
#define LIN_ERR_vect        _VECTOR(21)  /* LIN Error */
#define PCINT0_vect         _VECTOR(22)  /* Pin Change Interrupt Request 0 */
#define PCINT1_vect         _VECTOR(23)  /* Pin Change Interrupt Request 1 */
#define PCINT2_vect         _VECTOR(24)  /* Pin Change Interrupt Request 2 */
#define PCINT3_vect         _VECTOR(25)  /* Pin Change Interrupt Request 3 */
#define SPI_STC_vect        _VECTOR(26)  /* SPI Serial Transfer Complete */
#define ADC_vect            _VECTOR(27)  /* ADC Conversion Complete */
#define WDT_vect            _VECTOR(28)  /* Watchdog Time-Out Interrupt */
#define EE_READY_vect       _VECTOR(29)  /* EEPROM Ready */
#define SPM_READY_vect      _VECTOR(30)  /* Store Program Memory Read */

#define _VECTORS_SIZE (31 * 4)


/* Constants */
#define SPM_PAGESIZE (64) 
#define RAMSTART     (0x100)
#define RAMSIZE      (0x800)
#define RAMEND       (RAMSTART + RAMSIZE - 1)  /* Last On-Chip SRAM Location */
#define XRAMSIZE     (0)
#define XRAMEND      (RAMEND + XRAMSIZE)
#define E2END        (0x3FF)
#define E2PAGESIZE   (4)
#define FLASHEND     (0x7FFF)


